In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[ 1.02532007, -0.3181961 , -0.63571213],
       [ 0.1211604 ,  0.38253855, -0.67493068],
       [ 0.89334064,  1.07512546,  2.01537827],
       [-0.41462088,  0.44897444,  0.90226428]])

In [4]:
dataFrame= pd.DataFrame(data)

In [5]:
dataFrame

          0         1         2
0  1.025320 -0.318196 -0.635712
1  0.121160  0.382539 -0.674931
2  0.893341  1.075125  2.015378
3 -0.414621  0.448974  0.902264

In [7]:
yeniDataFrame = pd.DataFrame(data, index=["atil","zeynep","atlas","mehmet"], columns=["maas","yas","calisma saati"])

In [8]:
yeniDataFrame

            maas       yas  calisma saati
atil    1.025320 -0.318196      -0.635712
zeynep  0.121160  0.382539      -0.674931
atlas   0.893341  1.075125       2.015378
mehmet -0.414621  0.448974       0.902264

In [9]:
yeniDataFrame["yas"]

atil     -0.318196
zeynep    0.382539
atlas     1.075125
mehmet    0.448974
Name: yas, dtype: float64

In [10]:
yeniDataFrame.loc["atil"]

maas             1.025320
yas             -0.318196
calisma saati   -0.635712
Name: atil, dtype: float64

In [11]:
#row değerini çekmek için .loc kullanılır. .iloc ise index mantığı el alır

In [12]:
yeniDataFrame.iloc[1]

maas             0.121160
yas              0.382539
calisma saati   -0.674931
Name: zeynep, dtype: float64

In [19]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["yas"]+yeniDataFrame["yas"]

In [20]:
yeniDataFrame

            maas       yas  calisma saati  EmekliliK Yasi  Emeklilik Yasi
atil    1.025320 -0.318196      -0.635712       -0.636392       -0.636392
zeynep  0.121160  0.382539      -0.674931        0.765077        0.765077
atlas   0.893341  1.075125       2.015378        2.150251        2.150251
mehmet -0.414621  0.448974       0.902264        0.897949        0.897949

In [21]:
#kalıcı şekilde kolon silmek için axis belirtmek gerek. .drop u tek kullanırsak o anlık siler. Tekrardan komut çağırıldığında
#ilk hali şekilde devam eder.

In [22]:
yeniDataFrame.drop("Emeklilik Yasi", axis=1)

            maas       yas  calisma saati  EmekliliK Yasi
atil    1.025320 -0.318196      -0.635712       -0.636392
zeynep  0.121160  0.382539      -0.674931        0.765077
atlas   0.893341  1.075125       2.015378        2.150251
mehmet -0.414621  0.448974       0.902264        0.897949

In [23]:
yeniDataFrame.drop("EmekliliK Yasi", axis=1, inplace=True)

In [24]:
yeniDataFrame

            maas       yas  calisma saati  Emeklilik Yasi
atil    1.025320 -0.318196      -0.635712       -0.636392
zeynep  0.121160  0.382539      -0.674931        0.765077
atlas   0.893341  1.075125       2.015378        2.150251
mehmet -0.414621  0.448974       0.902264        0.897949

In [25]:
yeniDataFrame.drop("Emeklilik Yasi", axis=1, inplace=True)

In [26]:
yeniDataFrame

            maas       yas  calisma saati
atil    1.025320 -0.318196      -0.635712
zeynep  0.121160  0.382539      -0.674931
atlas   0.893341  1.075125       2.015378
mehmet -0.414621  0.448974       0.902264

In [27]:
yeniDataFrame.loc["atil"]["yas"]

-0.3181960987992283

In [28]:
yeniDataFrame.loc["atil","yas"]

-0.3181960987992283

In [29]:
yeniDataFrame<0

         maas    yas  calisma saati
atil    False   True           True
zeynep  False  False           True
atlas   False  False          False
mehmet   True  False          False

In [30]:
booleanFrame= yeniDataFrame<0

In [31]:
booleanFrame

         maas    yas  calisma saati
atil    False   True           True
zeynep  False  False           True
atlas   False  False          False
mehmet   True  False          False

In [32]:
yeniDataFrame[booleanFrame]

            maas       yas  calisma saati
atil         NaN -0.318196      -0.635712
zeynep       NaN       NaN      -0.674931
atlas        NaN       NaN            NaN
mehmet -0.414621       NaN            NaN

In [34]:
yeniDataFrame[yeniDataFrame["yas"]>0]

            maas       yas  calisma saati
zeynep  0.121160  0.382539      -0.674931
atlas   0.893341  1.075125       2.015378
mehmet -0.414621  0.448974       0.902264

In [35]:
yeniDataFrame.reset_index()

    index      maas       yas  calisma saati
0    atil  1.025320 -0.318196      -0.635712
1  zeynep  0.121160  0.382539      -0.674931
2   atlas  0.893341  1.075125       2.015378
3  mehmet -0.414621  0.448974       0.902264

In [36]:
yeniDataFrame

            maas       yas  calisma saati
atil    1.025320 -0.318196      -0.635712
zeynep  0.121160  0.382539      -0.674931
atlas   0.893341  1.075125       2.015378
mehmet -0.414621  0.448974       0.902264

In [37]:
yeniIndeksListesi= ["ati","zey","atl","meh"]

In [38]:
yeniDataFrame["Yeni Indeks"]= yeniIndeksListesi

In [39]:
yeniDataFrame

            maas       yas  calisma saati Yeni Indeks
atil    1.025320 -0.318196      -0.635712         ati
zeynep  0.121160  0.382539      -0.674931         zey
atlas   0.893341  1.075125       2.015378         atl
mehmet -0.414621  0.448974       0.902264         meh

In [40]:
yeniDataFrame.set_index("Yeni Indeks")

                 maas       yas  calisma saati
Yeni Indeks
ati          1.025320 -0.318196      -0.635712
zey          0.121160  0.382539      -0.674931
atl          0.893341  1.075125       2.015378
meh         -0.414621  0.448974       0.902264

In [41]:
yeniDataFrame.set_index("Yeni Indeks",inplace=True)

In [42]:
yeniDataFrame

                 maas       yas  calisma saati
Yeni Indeks
ati          1.025320 -0.318196      -0.635712
zey          0.121160  0.382539      -0.674931
atl          0.893341  1.075125       2.015378
meh         -0.414621  0.448974       0.902264

In [43]:
ilkIndeksler = ["simpson","simpson","simpson","south park","south park","south park"]

In [44]:
icIndeksler = ["hamer","bart","marge", "cartman","kenny","kyle"]

In [45]:
birlesmisIndeks=list(zip(ilkIndeksler, icIndeksler))

In [47]:
birlesmisIndeks

[('simpson', 'hamer'),
 ('simpson', 'bart'),
 ('simpson', 'marge'),
 ('south park', 'cartman'),
 ('south park', 'kenny'),
 ('south park', 'kyle')]

In [48]:
birlesmisIndeks=pd.MultiIndex.from_tuples(birlesmisIndeks)

In [49]:
birlesmisIndeks

MultiIndex([(   'simpson',   'hamer'),
            (   'simpson',    'bart'),
            (   'simpson',   'marge'),
            ('south park', 'cartman'),
            ('south park',   'kenny'),
            ('south park',    'kyle')],
           )

In [51]:
benimCizgiFilmListem=[[40,"a"],[10,"b"],[30,"c"],[9,"d"],[10,"e"],[11,"f"]]

In [52]:
CizgiFilmNumpyDizisi=np.array(benimCizgiFilmListem)

In [53]:
cizgiFilmDataFrame=pd.DataFrame(CizgiFilmNumpyDizisi, index=birlesmisIndeks, columns=["yas","meslek"])

In [55]:
cizgiFilmDataFrame

                   yas meslek
simpson    hamer    40      a
           bart     10      b
           marge    30      c
south park cartman   9      d
           kenny    10      e
           kyle     11      f

In [58]:
cizgiFilmDataFrame.loc["south park"].loc["kenny"]

yas       10
meslek     e
Name: kenny, dtype: object

In [60]:
cizgiFilmDataFrame.index.names=["Film Adi","isim"]

In [61]:
cizgiFilmDataFrame

                   yas meslek
Film Adi   isim
simpson    hamer    40      a
           bart     10      b
           marge    30      c
south park cartman   9      d
           kenny    10      e
           kyle     11      f